#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.shared-k8s-master.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        cluster_ipv4_cidr           = "10.60.0.0/14"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "35.238.107.111"
        id                          = "projects/broad-gotc-dev/locations/us-central1-a/clusters/gotc-dev-shared-us-central1-a"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/broad-gotc-dev/zones/us-central1-a/instanceGroups/gke-gotc-dev-shared--gotc-dev-shared--2529cc0b-grp",
        ]
        location                    = "us-central1-a"
        logging_service             = "logging.googleapis.com/kubernetes"
        master_version              = "1.15.9-gke.26"
      ~ min_master_version          = "1.15.9-gke.26" -> "1.15.11-gke.1"
        monitoring_service          = "monitoring.googleapis.com/kubernetes"
        name                        = "gotc-dev-shared-us-central1-a"
        network                     = "projects/broad-gotc-dev/global/networks/app-network"
        node_locations              = []
        node_version                = "1.15.9-gke.26"
        project                     = "broad-gotc-dev"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.188.0.0/20"
        subnetwork                  = "projects/broad-gotc-dev/regions/us-central1/subnetworks/app-network"

        addons_config {

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            enabled = false
        }

        database_encryption {
            state = "DECRYPTED"
        }

        ip_allocation_policy {
            cluster_ipv4_cidr_block       = "10.60.0.0/14"
            cluster_secondary_range_name  = "gke-gotc-dev-shared-us-central1-a-pods-85df87c6"
            create_subnetwork             = false
            services_ipv4_cidr_block      = "10.188.0.0/20"
            services_secondary_range_name = "gke-gotc-dev-shared-us-central1-a-services-85df87c6"
            use_ip_aliases                = false
        }

        master_auth {
            client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMyekNDQWNPZ0F3SUJBZ0lSQUxMWWpyTjd4TjI5YXFmZFZzK0JSNXN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1pqY3lZamN5TUdZdE1tUTBZeTAwTWpJd0xXRm1OMk10WldRNE0yUmtZV1kxTW1NdwpNQjRYRFRJd01ETXlOREUxTVRZd01sb1hEVEkxTURNeU16RTFNVFl3TWxvd0VURVBNQTBHQTFVRUF4TUdZMnhwClpXNTBNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXV6UkFCTEc0OXRtdXJtUW0KeEpDMnJHTUJaaVJad3VjQU9SSHJyZE04cTMrOTg0cWxZRTNLamVMVmloeis0d1BXT2JXYlNBL0UwMzNPeWFmNgpNN2ljSVBVcElTSG5lbTExK0dXYXZMUkFXbUxXeEVZNDJBOHNaYzY3SWRvQnBuVnZoWVhxMjBxMG95bHRhQUpYCmVaYXZtekZuR3V2K2RuSTQvTExCRHRPd3hOZDlpWnZTbGxJY1VRWkZwM2VLNDZqUFgwc2pCei9xUlVDUFpSdW8Kck5Mc0FmZThIbnJjL2Z6R3Q0MVgwWUwxdXQybWExRnhIbnFUNm4rSVVTeDk4UGFJNVpyMWdzNjA2WTV6dSthaQp0ajg1MEhxTVlYZUpOeE42aXJHTm1FOTNndy9NQlgxODdvZ2lCVHA2ZmdLUXVxMnJLbnlkMk11WVc1U1lycUlGCnFqWW9Rd0lEQVFBQm94QXdEakFNQmdOVkhSTUJBZjhFQWpBQU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ2IKTDV2NE5YNnR4dml0TGlJYnllZDB4VlltTmlzT3lqSWthVW5nRit0Ym5iSEtBSUhnM1VLbEpsUm0yRW83MnFzeQpQaFV6UytmVjJUSmQybFhsMWxqM1JNdTdCb2ZyUnJpK3VMcCtUdVhYY0ovVnhSSnJVMHVFZ21WcjdFYnRMblNQCnoxemlEYVBIeUFWVlpQdnluVFo0a2EzdWd6MGFUZEdkVk9GeTZJUHJmam03d1lYL1hsZEMzUTQwTzFQd0ZJQlAKZitRcmlva09Sa0RGZ084V08rQk9YYmFkbnpkaWlCa0FudWk4cWFEUTZaeHBuZkRVbHl5SFFLc20xNzVzRXJGSApvaHovSEluMkhXUlZRK0N6Tkh5bHB0ZktXZ3p5T2YyN0RYOENJRnNPQm9YSlBFVTg5WUhWNEx5K25BWEI5UWsxCnpLSzZtRjQ3QXAyaGd0YVNhdUF4Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            client_key             = (sensitive value)
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRV3FSd09HOUFJZnRYU2M5U3VCS29FekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSbU56SmlOekl3WmkweVpEUmpMVFF5TWpBdFlXWTNZeTFsWkRnelpHUmhaalV5WXpBdwpIaGNOTWpBd016STBNVFF4TmpBeFdoY05NalV3TXpJek1UVXhOakF4V2pBdk1TMHdLd1lEVlFRREV5Um1OekppCk56SXdaaTB5WkRSakxUUXlNakF0WVdZM1l5MWxaRGd6WkdSaFpqVXlZekF3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUUMwS0pxZ2l1T3d1aTJxU1dqTEk1QkJ2YkpDSU5tb3Rnazl0YVJXU1YwTQo0eTVLTHRsekNoeHNvVlVLOEprT2RkWUhBbDBNb203dmNpcVB6bUtid2Jka2taNmpuLy9YV25qcEFkcDFFTnp2CkJsd2dTRTRQUTFvSHhrRTVMV0hDSzVzMXBPQ296czcvRU1EL1BhWHZZdXJsQnhuK0s2eVhNb2FwYXExZFNpSmIKdHBIK2E2ZlB0ckJZVmwxa08zMVFsVG8xc283RVFXWXBUUjlSRlZacEZ2RE01NDBySHU3ZmFWTWxvMkhrVXVodApDejJ2VDduTW11bHlqYnBrZ1BOTERNNTJidTdNL0FrUUxsOXh0dlY4ZGIwWStZVnhNSkRqQkxZOXA4M1piSUg3CldXSHp1Wmphai9DRmRCMHVFK2tsMTB5SFVJZTMzSE9jMDRLQVh1anpGeUlOQWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFDdwpMamdVSWI5RW52QVgwaERxUXh4cU1oM1RWUWFIckNIL3J0dTBhV29XZytLY1NkWEZTYTIwYmdTMjAxSGZDeWtuCkxadGNUMG5wbVVNeUtMV0x6MzJmdS9uNHFJVzZvQk1JYWVjWW9oM0tTVmUwU2xtZVlzaFMyVlRmRlNRWnlyTnYKNS9naktIMThQM1FtMTZ5WUpCL3l3cXc2ZDVrZEpoMk9JQkJMeGFMa3I1Skx1RE94OUQ0N2U4RmM4Z25Gamo1LwplLzJpdjBWQk1adjFwblVBZjdiUzhtcWNGWDZVSFFPOEQxSzFaMTRQcmExNEZGQy8vTzJTRWViVFBKeDNxZVEvCm9Md3JjK2JxSzN6VklQdjBwd2c5eE52ck5YbW5PNWdZYzM0T1ZGZkIwWGwreHVweks4cndodHkyL3lhL25jR0IKN3VRN3hwNVRmcHpZM0V0VjRNdWwKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="

            client_certificate_config {
                issue_client_certificate = true
            }
        }

        master_authorized_networks_config {
            cidr_blocks {
                cidr_block = "69.173.112.0/21"
            }
            cidr_blocks {
                cidr_block = "69.173.120.0/22"
            }
            cidr_blocks {
                cidr_block = "69.173.124.0/23"
            }
            cidr_blocks {
                cidr_block = "69.173.126.0/24"
            }
            cidr_blocks {
                cidr_block = "69.173.127.0/25"
            }
            cidr_blocks {
                cidr_block = "69.173.127.128/26"
            }
            cidr_blocks {
                cidr_block = "69.173.127.192/27"
            }
            cidr_blocks {
                cidr_block = "69.173.127.224/30"
            }
            cidr_blocks {
                cidr_block = "69.173.127.228/32"
            }
            cidr_blocks {
                cidr_block = "69.173.127.230/31"
            }
            cidr_blocks {
                cidr_block = "69.173.127.232/29"
            }
            cidr_blocks {
                cidr_block = "69.173.127.240/28"
            }
            cidr_blocks {
                cidr_block = "69.173.64.0/19"
            }
            cidr_blocks {
                cidr_block = "69.173.96.0/20"
            }
        }

        network_policy {
            enabled = true
        }

        node_config {
            disk_size_gb      = 50
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {
                "pool" = "01"
            }
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints"         = "true"
                "google-compute-enable-virtio-rng" = "false"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = []
            taint             = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }

            workload_metadata_config {
                node_metadata = "SECURE"
            }
        }

        node_pool {
            initial_node_count  = 3
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/broad-gotc-dev/zones/us-central1-a/instanceGroupManagers/gke-gotc-dev-shared--gotc-dev-shared--2529cc0b-grp",
            ]
            max_pods_per_node   = 110
            name                = "gotc-dev-shared-us-central1-a-01"
            node_count          = 3
            node_locations      = [
                "us-central1-a",
            ]
            version             = "1.15.9-gke.26"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 50
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {
                    "pool" = "01"
                }
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints"         = "true"
                    "google-compute-enable-virtio-rng" = "false"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/compute",
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = []
                taint             = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }

                workload_metadata_config {
                    node_metadata = "SECURE"
                }
            }
        }

        pod_security_policy_config {
            enabled = true
        }

        private_cluster_config {
            enable_private_endpoint = false
            enable_private_nodes    = true
            master_ipv4_cidr_block  = "10.127.0.0/28"
            peering_name            = "gke-n99143df0be439395935-c22e-c74b-peer"
            private_endpoint        = "10.127.0.2"
            public_endpoint         = "35.238.107.111"
        }

        release_channel {
            channel = "UNSPECIFIED"
        }
    }

  # module.wfl-auth-proxy.google_compute_global_address.global_ip will be created
  + resource "google_compute_global_address" "global_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "wfl-auth-global-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.wfl-auth-proxy.module.dns-set.google_dns_record_set.set_dns_record["wfl-auth"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "gotc-dev"
      + name         = "wfl-auth.gotc-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: "path": [DEPRECATED] Use the "prefix" option instead


```

</details>

*Workflow: `Terraform Deploy Test - gotc-dev`, Action: `hashicorpterraform-github-actions4`, Working Directory: `deploy/gotc-dev`, Workspace: `default`*
